avr-rust/avrd/packs/xmegab/ATxmega128B3.atdf
          </instance>
          <instance name="DFLLRC2M">
            <register-group address-space="data" offset="0x0068" name-in-module="DFLL" name="DFLLRC2M"/>
          </instance>
        </module>
        <module name="PR" id="I6080" version="XMEGAB">
          <instance name="PR">
            <register-group address-space="data" offset="0x0070" name-in-module="PR" name="PR"/>
          </instance>
        </module>
        <module name="RST" id="I6083" version="XMEGAAU">
          <instance name="RST">
            <register-group address-space="data" offset="0x0078" name-in-module="RST" name="RST"/>
          </instance>
        </module>
        <module name="WDT" id="I6078">
          <instance name="WDT">
            <register-group address-space="data" offset="0x0080" name-in-module="WDT" name="WDT"/>
          </instance>
        </module>
        <module name="MCU" id="I6091" version="XMEGAB">
          <instance name="MCU">
            <register-group address-space="data" offset="0x0090" name-in-module="MCU" name="MCU"/>
          </instance>
        </module>
        <module name="PMIC" id="I6057">
          <instance name="PMIC">
            <register-group address-space="data" offset="0x00A0" name-in-module="PMIC" name="PMIC"/>
          </instance>
        </module>
        <module name="PORTCFG" id="I6075" version="XMEGAB">
          <instance name="PORTCFG">
            <register-group address-space="data" offset="0x00B0" name-in-module="PORTCFG" name="PORTCFG"/>
            <signals>
              <signal field="CLKOUT" function="CLKOUTC" group="CLKOUT" pad="PD7"/>
              <signal field="EVOUT" function="EVOUTC" group="EVOUT" pad="PD7"/>
              <signal field="RTCOUT" function="RTCOUTC" group="RTCOUT" pad="PD6"/>
            </signals>
          </instance>
        </module>
        <module name="AES" id="I6096">
          <instance name="AES">
            <register-group address-space="data" offset="0x0C0" name-in-module="AES" name="AES"/>
          </instance>
        </module>
        <module name="CRC" id="I6111" version="XMEGAB">
          <instance name="CRC">
            <register-group address-space="data" offset="0x0D0" name-in-module="CRC" name="CRC"/>
          </instance>
        </module>
        <module name="DMA" id="I3000" version="XMEGAB">
          <instance name="DMA">
            <register-group address-space="data" offset="0x0100" name-in-module="DMA" name="DMA"/>
          </instance>
        </module>
        <module name="EVSYS" id="I6061" version="XMEGAB">
          <instance name="EVSYS">
            <register-group address-space="data" offset="0x0180" name-in-module="EVSYS" name="EVSYS"/>
          </instance>
        </module>
        <module name="NVM" id="I6076" version="XMEGAAU">
          <instance name="NVM">
            <register-group address-space="data" offset="0x01C0" name-in-module="NVM" name="NVM"/>
          </instance>
        </module>
        <module name="ADC" id="I6110" version="XMEGAB">
          <instance name="ADCB">
            <register-group address-space="data" offset="0x0240" name-in-module="ADC" name="ADCB"/>
            <signals>
              <signal function="ADC" group="ADC" index="0" pad="PB0"/>
              <signal function="ADC" group="ADC" index="1" pad="PB1"/>
              <signal function="ADC" group="ADC" index="2" pad="PB2"/>
              <signal function="ADC" group="ADC" index="3" pad="PB3"/>
              <signal function="ADC" group="ADC" index="4" pad="PB4"/>
              <signal function="ADC" group="ADC" index="5" pad="PB5"/>
              <signal function="ADC" group="ADC" index="6" pad="PB6"/>
              <signal function="ADC" group="ADC" index="7" pad="PB7"/>
              <signal function="AREF" group="REFB" index="0" pad="PB0"/>
            </signals>
          </instance>
        </module>
        <module name="AC" id="I6077" version="XMEGAB">
          <instance name="ACB">
            <register-group address-space="data" offset="0x0390" name-in-module="AC" name="ACB"/>
            <signals>
              <signal function="AC" group="AC" index="0" pad="PB0"/>
              <signal function="AC" group="AC" index="1" pad="PB1"/>
              <signal function="AC" group="AC" index="2" pad="PB2"/>
              <signal function="AC" group="AC" index="3" pad="PB3"/>
              <signal function="AC" group="AC" index="4" pad="PB4"/>
              <signal function="AC" group="AC" index="5" pad="PB5"/>
              <signal function="AC" group="AC" index="6" pad="PB6"/>
              <signal function="AC" group="AC" index="7" pad="PB7"/>
              <signal function="ACOUT" group="ACOUT" index="1" pad="PB6"/>
              <signal function="ACOUT" group="ACOUT" index="0" pad="PB7"/>
            </signals>
          </instance>
        </module>
        <module name="RTC" id="I6093">
          <instance name="RTC">
            <register-group address-space="data" offset="0x0400" name-in-module="RTC" name="RTC"/>
          </instance>
        </module>
        <module name="TWI" id="I6089" version="XMEGAAU">
          <instance name="TWIC">
            <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
            <signals>
              <signal function="TWI" group="SDA" pad="PC0"/>
              <signal function="TWI" group="SCL" pad="PC1"/>
            </signals>
          </instance>
        </module>
        <module name="USB" id="I3005" version="XMEGAAU">
          <instance name="USB">
            <register-group address-space="data" offset="0x4C0" name-in-module="USB" name="USB"/>
            <signals>
              <signal function="USB" group="DN" pad="PD0"/>
              <signal function="USB" group="DP" pad="PD1"/>
            </signals>
          </instance>
        </module>
        <module name="PORT" id="I6075" version="XMEGAAU">
          <instance name="PORTB">
            <register-group address-space="data" offset="0x0620" name-in-module="PORT" name="PORTB"/>
            <signals>
              <signal function="PORTB" group="P" index="0" pad="PB0"/>
              <signal function="PORTB" group="P" index="1" pad="PB1"/>
              <signal function="PORTB" group="P" index="2" pad="PB2"/>
              <signal function="PORTB" group="P" index="3" pad="PB3"/>
              <signal function="PORTB" group="P" index="4" pad="PB4"/>
              <signal function="PORTB" group="P" index="5" pad="PB5"/>
              <signal function="PORTB" group="P" index="6" pad="PB6"/>
              <signal function="PORTB" group="P" index="7" pad="PB7"/>
            </signals>
          </instance>
