avr-rust/avrd/packs/xmegab/ATxmega128B3.atdf
      <value-group caption="Brownout Detection Voltage Level" name="BODLVL">
        <value caption="1.6 V" name="1V6" value="0x07"/>
        <value caption="1.8 V" name="1V8" value="0x06"/>
        <value caption="2.0 V" name="2V0" value="0x05"/>
        <value caption="2.2 V" name="2V2" value="0x04"/>
        <value caption="2.4 V" name="2V4" value="0x03"/>
        <value caption="2.6 V" name="2V6" value="0x02"/>
        <value caption="2.8 V" name="2V8" value="0x01"/>
        <value caption="3.0 V" name="3V0" value="0x00"/>
      </value-group>
    </module>
    <module name="LOCKBIT" id="I6570" version="XMEGAAU" caption="Fuses and Lockbits">
      <register-group caption="Lock Bits" name="NVM_LOCKBITS">
        <register caption="Lock Bits" name="LOCKBITS" offset="0x00" size="1">
          <bitfield caption="Boot Lock Bits - Boot Section" mask="0xC0" name="BLBB" values="FUSE_BLBB"/>
          <bitfield caption="Boot Lock Bits - Application Section" mask="0x30" name="BLBA" values="FUSE_BLBA"/>
          <bitfield caption="Boot Lock Bits - Application Table" mask="0x0C" name="BLBAT" values="FUSE_BLBAT"/>
          <bitfield caption="Lock Bits" mask="0x03" name="LB" values="FUSE_LB"/>
        </register>
      </register-group>
      <value-group caption="Boot lock bits - boot setcion" name="FUSE_BLBB">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Boot lock bits - application section" name="FUSE_BLBA">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Boot lock bits - application table section" name="FUSE_BLBAT">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Lock bits" name="FUSE_LB">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
    </module>
    <module name="SIGROW" id="I3600" version="XMEGAB" caption="Signature Row">
      <register-group caption="Production Signatures" name="NVM_PROD_SIGNATURES" size="72">
        <register caption="RCOSC 2 MHz Calibration Value B" name="RCOSC2M" offset="0x00" size="1"/>
        <register caption="RCOSC 2 MHz Calibration Value A" name="RCOSC2MA" offset="0x01" size="1"/>
        <register caption="RCOSC 32.768 kHz Calibration Value" name="RCOSC32K" offset="0x02" size="1"/>
        <register caption="RCOSC 32 MHz Calibration Value B" name="RCOSC32M" offset="0x03" size="1"/>
        <register caption="RCOSC 32 MHz Calibration Value A" name="RCOSC32MA" offset="0x04" size="1"/>
        <register caption="Lot Number Byte 0, ASCII" name="LOTNUM0" offset="0x08" size="1"/>
        <register caption="Lot Number Byte 1, ASCII" name="LOTNUM1" offset="0x09" size="1"/>
        <register caption="Lot Number Byte 2, ASCII" name="LOTNUM2" offset="0x0A" size="1"/>
        <register caption="Lot Number Byte 3, ASCII" name="LOTNUM3" offset="0x0B" size="1"/>
        <register caption="Lot Number Byte 4, ASCII" name="LOTNUM4" offset="0x0C" size="1"/>
        <register caption="Lot Number Byte 5, ASCII" name="LOTNUM5" offset="0x0D" size="1"/>
        <register caption="Wafer Number" name="WAFNUM" offset="0x10" size="1"/>
        <register caption="Wafer Coordinate X Byte 0" name="COORDX0" offset="0x12" size="1"/>
        <register caption="Wafer Coordinate X Byte 1" name="COORDX1" offset="0x13" size="1"/>
        <register caption="Wafer Coordinate Y Byte 0" name="COORDY0" offset="0x14" size="1"/>
        <register caption="Wafer Coordinate Y Byte 1" name="COORDY1" offset="0x15" size="1"/>
        <register caption="USB Calibration Byte 0" name="USBCAL0" offset="0x1A" size="1"/>
        <register caption="USB Calibration Byte 1" name="USBCAL1" offset="0x1B" size="1"/>
        <register caption="USB RCOSC Calibration Value B" name="USBRCOSC" offset="0x1C" size="1"/>
        <register caption="USB RCOSC Calibration Value A" name="USBRCOSCA" offset="0x1D" size="1"/>
        <register caption="ADCA Calibration Byte 0" name="ADCACAL0" offset="0x20" size="1"/>
        <register caption="ADCA Calibration Byte 1" name="ADCACAL1" offset="0x21" size="1"/>
        <register caption="ADCB Calibration Byte 0" name="ADCBCAL0" offset="0x24" size="1"/>
        <register caption="ADCB Calibration Byte 1" name="ADCBCAL1" offset="0x25" size="1"/>
        <register caption="Temperature Sensor Calibration Byte 0" name="TEMPSENSE0" offset="0x2E" size="1"/>
        <register caption="Temperature Sensor Calibration Byte 1" name="TEMPSENSE1" offset="0x2F" size="1"/>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="QFP_QFN_64">
      <pin pad="PC0" position="1"/>
      <pin pad="PC1" position="2"/>
      <pin pad="PC2" position="3"/>
      <pin pad="PC3" position="4"/>
      <pin pad="PC4" position="5"/>
      <pin pad="PC5" position="6"/>
      <pin pad="PC6" position="7"/>
      <pin pad="PC7" position="8"/>
      <pin pad="GND" position="9"/>
      <pin pad="VCC" position="10"/>
      <pin pad="PD0" position="11"/>
      <pin pad="PD1" position="12"/>
      <pin pad="RESET" position="13"/>
      <pin pad="PDI" position="14"/>
      <pin pad="GND" position="15"/>
      <pin pad="VCC" position="16"/>
      <pin pad="PG0" position="17"/>
      <pin pad="PG1" position="18"/>
      <pin pad="PG2" position="19"/>
      <pin pad="PG3" position="20"/>
      <pin pad="PG4" position="21"/>
      <pin pad="PG5" position="22"/>
      <pin pad="PG6" position="23"/>
      <pin pad="PG7" position="24"/>
      <pin pad="PM0" position="25"/>
      <pin pad="PM1" position="26"/>
      <pin pad="PM2" position="27"/>
      <pin pad="PM3" position="28"/>
      <pin pad="PM4" position="29"/>
      <pin pad="PM5" position="30"/>
      <pin pad="PM6" position="31"/>
      <pin pad="PM7" position="32"/>
      <pin pad="SEG8" position="33"/>
      <pin pad="SEG7" position="34"/>
      <pin pad="SEG6" position="35"/>
      <pin pad="SEG5" position="36"/>
      <pin pad="SEG4" position="37"/>
      <pin pad="SEG3" position="38"/>
      <pin pad="SEG2" position="39"/>
      <pin pad="SEG1" position="40"/>
      <pin pad="SEG0" position="41"/>
      <pin pad="GND" position="42"/>
      <pin pad="VCC" position="43"/>
      <pin pad="BIAS1" position="44"/>
      <pin pad="BIAS2" position="45"/>
      <pin pad="VLCD" position="46"/>
      <pin pad="CAPL" position="47"/>
      <pin pad="CAPH" position="48"/>
      <pin pad="COM0" position="49"/>
      <pin pad="COM1" position="50"/>
      <pin pad="COM2" position="51"/>
      <pin pad="COM3" position="52"/>
      <pin pad="PR0" position="53"/>
      <pin pad="PR1" position="54"/>
      <pin pad="AGND" position="55"/>
      <pin pad="AVCC" position="56"/>
      <pin pad="PB0" position="57"/>
      <pin pad="PB1" position="58"/>
      <pin pad="PB2" position="59"/>
      <pin pad="PB3" position="60"/>
      <pin pad="PB4" position="61"/>
      <pin pad="PB5" position="62"/>
      <pin pad="PB6" position="63"/>
      <pin pad="PB7" position="64"/>
    </pinout>
    <pinout name="DRQFN_64">
      <pin pad="PC0" position="A1"/>
      <pin pad="PC1" position="B1"/>
      <pin pad="PC2" position="A2"/>
      <pin pad="PC3" position="B2"/>
      <pin pad="PC4" position="A3"/>
      <pin pad="PC5" position="B3"/>
      <pin pad="PC6" position="A4"/>
      <pin pad="GND" position="B4"/>
      <pin pad="PC7" position="A5"/>
      <pin pad="PD0" position="B5"/>
      <pin pad="VCC" position="A6"/>
      <pin pad="RESET" position="B6"/>
      <pin pad="PD1" position="A7"/>
      <pin pad="PDI" position="B7"/>
      <pin pad="GND" position="A8"/>
      <pin pad="PG0" position="A9"/>
      <pin pad="VCC" position="B8"/>
      <pin pad="PG2" position="A10"/>
      <pin pad="PG1" position="B9"/>
      <pin pad="PG3" position="A11"/>
      <pin pad="PG4" position="B10"/>
      <pin pad="PG5" position="A12"/>
      <pin pad="PG6" position="B11"/>
      <pin pad="PG7" position="A13"/>
      <pin pad="PM0" position="B12"/>
      <pin pad="PM1" position="A14"/>
      <pin pad="PM2" position="B13"/>
      <pin pad="PM3" position="A15"/>
      <pin pad="PM5" position="B14"/>
      <pin pad="PM4" position="A16"/>
      <pin pad="PM7" position="B15"/>
      <pin pad="PM6" position="A17"/>
      <pin pad="SEG7" position="A18"/>
      <pin pad="SEG8" position="B16"/>
      <pin pad="SEG6" position="A19"/>
      <pin pad="SEG5" position="B17"/>
      <pin pad="SEG4" position="A20"/>
      <pin pad="SEG3" position="B18"/>
      <pin pad="SEG2" position="A21"/>
      <pin pad="SEG1" position="B19"/>
      <pin pad="SEG0" position="A22"/>
      <pin pad="GND" position="B20"/>
      <pin pad="VCC" position="A23"/>
      <pin pad="BIAS1" position="B21"/>
      <pin pad="BIAS2" position="A24"/>
      <pin pad="VLCD" position="B22"/>
      <pin pad="CAPL" position="A25"/>
      <pin pad="CAPH" position="A26"/>
      <pin pad="COM0" position="B23"/>
      <pin pad="COM1" position="A27"/>
      <pin pad="COM2" position="B24"/>
      <pin pad="COM3" position="A28"/>
      <pin pad="PR0" position="B25"/>
      <pin pad="PR1" position="A29"/>
      <pin pad="AGND" position="B26"/>
      <pin pad="PB0" position="A30"/>
      <pin pad="AVCC" position="B27"/>
      <pin pad="PB1" position="A31"/>
      <pin pad="PB2" position="B28"/>
      <pin pad="PB3" position="A32"/>
      <pin pad="PB4" position="B29"/>
      <pin pad="PB5" position="A33"/>
      <pin pad="PB7" position="B30"/>
      <pin pad="PB6" position="A34"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
